docs/Topics/SoftwareDevelopment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 20:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Software Tools</title>
<meta name="author" content="Elle Najt" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Software Tools</h1>
<p>
I like building and learning tools. Time spent reducing frictions pays dividends.<br />
</p>
<div id="outline-container-orgd1ebbf8" class="outline-2">
<h2 id="orgd1ebbf8">Side projects:</h2>
<div class="outline-text-2" id="text-orgd1ebbf8">
<p>
I love org babel notebooks, they&rsquo;re much more ergonomic than jupyter notebooks. Out of the box they are missing features, but I&rsquo;ve been adding the missing features over time:<br />
</p>
<ul class="org-ul">
<li><a href="https://github.com/ElleNajt/ob-python-extras">ob-python-extras</a> - Making org babel a full-featured replacement for jupyter notebooks<br /></li>
<li><a href="https://github.com/ElleNajt/vibe-duet/">vibe-duet</a> - Tools for vibe coding music with strudel. Try it out! It&rsquo;s fun. :)<br /></li>
<li><a href="https://github.com/ElleNajt/meta-agent-shell">meta-agent-shell</a> - Multi agent management in emacs agent-shell<br /></li>
<li><a href="https://github.com/ElleNajt/agent-bedtime">agent-bedtime</a> - So coding agents can send you to bed<br /></li>
<li><a href="https://github.com/ElleNajt/agent-timecard">agent-timecard</a> - Get reports on how you&rsquo;re spending time, based on conversation turns with coding agents<br /></li>
<li><a href="https://github.com/ElleNajt/acp-mobile">acp-mobile</a> - So you can take coding agents with you everywhere (wip)<br /></li>
<li><a href="https://github.com/ElleNajt/oneko-macs">oneko-macs</a> - A silly hack to have a neko cat in emacs<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org9d07154" class="outline-2">
<h2 id="org9d07154">Tools I love:</h2>
<div class="outline-text-2" id="text-org9d07154">
</div>
<div id="outline-container-org56bd007" class="outline-3">
<h3 id="org56bd007">Emacs</h3>
<div class="outline-text-3" id="text-org56bd007">
<p>
I love being able to shape my editor into a glove that fits me and my idiosyncrasies. This <b>so</b> easy now that we have coding agents.<br />
</p>

<blockquote>
<p>
What is emacs? Emacs is Freedom! Freedom to control how your software behave! Emacs is interconnectedness! All your tools can interact with each other as first class citizens! Emacs is eternal! We&rsquo;ve been using emacs since the 70s, and when we&rsquo;re all gerbil-humans living under AI rule in 2035, well still be using emacs! - Me<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgdc21774" class="outline-3">
<h3 id="orgdc21774">Org-mode</h3>
<div class="outline-text-3" id="text-orgdc21774">
<p>
I love working in org babel notebooks, they&rsquo;re much more ergonomic than jupyter notebooks. Out of the box they are missing features, but I&rsquo;ve been adding the missing features here over time <a href="https://github.com/ElleNajt/ob-python-extras">ob-python-extras</a> .<br />
</p>

<p>
This webpage generated from org mode files.<br />
</p>
</div>
</div>
<div id="outline-container-org526179c" class="outline-3">
<h3 id="org526179c">Nix</h3>
<div class="outline-text-3" id="text-org526179c">
<p>
I think Nix/NixOS is a good choice in an increasingly LLM agent driven world; they can read your config and edit, and you can see what they changed and roll back if things go wrong. It also makes it easy to spin up VMs out of your environment.<br />
</p>
</div>
</div>
<div id="outline-container-org20efa74" class="outline-3">
<h3 id="org20efa74">Git</h3>
<div class="outline-text-3" id="text-org20efa74">
<p>
I love git and versioning all sorts of things! I used to not like it very much, but it turned out I was just missing a clear mental model of what it was doing &#x2013;  <a href="https://git-scm.com/book/en/v2">pro-git</a> helped a lot!<br />
</p>
</div>
</div>
<div id="outline-container-orgccc15a1" class="outline-3">
<h3 id="orgccc15a1">LLMs</h3>
<div class="outline-text-3" id="text-orgccc15a1">
<p>
I live inside of Claude Code (inside of emacs).<br />
</p>
</div>
</div>
<div id="outline-container-org2b49948" class="outline-3">
<h3 id="org2b49948">Tests</h3>
<div class="outline-text-3" id="text-org2b49948">
<p>
I like tests as ways to guarantee behavior. They cost nothing to build because of LLMs.<br />
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Elle Najt</p>
<p class="email">Email: <a href="mailto:LNAJT4@gmail.com">LNAJT4@gmail.com</a></p>
<p class="date">Created: 2026-02-21 Sat 20:59</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
